web/SOAP.xml

POST /service/searchapi.asmx HTTP/1.1
Host: www.mouser.be
Content-Type: application/soap+xml; charset=utf-8
Content-Length: length

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <MouserHeader xmlns="http://api.mouser.com/service">
      <AccountInfo>
        <PartnerID>string</PartnerID>
      </AccountInfo>
    </MouserHeader>
  </soap12:Header>
  <soap12:Body>
    <SearchByKeyword xmlns="http://api.mouser.com/service">
      <keyword>string</keyword>
      <records>int</records>
      <startingRecord>int</startingRecord>
      <searchOptions>ID</searchOptions>
    </SearchByKeyword>
  </soap12:Body>
</soap12:Envelope>